In [4]:
import pandas as pd
import sqlite3

### Retrieve era information from CBDB

In [22]:
cnx = sqlite3.connect(r'C:\NLP\Raft\CBDB_aw_20180831_sqlite.db')

In [12]:
sql_statement = '''select * from nian_hao
where c_dy in (29,46,25,26,53,42,23,27,28,32,44,30)
'''
era_df = pd.read_sql_query(sql_statement, cnx)
cnx.close()

In [13]:
era_df.head()

,c_nianhao_id,c_dy,c_dynasty_chn,c_nianhao_chn,c_nianhao_pin,c_firstyear,c_lastyear
0,1,29,西漢,建元,None,-140,-135
1,2,29,西漢,元光,None,-134,-129
2,3,29,西漢,元朔,None,-128,-123
3,4,29,西漢,元狩,None,-122,-117
4,5,29,西漢,元鼎,None,-116,-111

In [15]:
NamedEntities = era_df.loc[:, ['c_nianhao_chn']]
NamedEntities.tail()

    c_nianhao_chn
217            普泰
218            中興
219            太昌
220            永興
221            永熙

In [2]:
era_df = pd.read_excel("DSSP_NamedEntities.xlsx", sheet_name="Era")

   c_dy c_dynasty_chn c_nianhao_chn  c_firstyear  c_lastyear
0    29            西漢            建元         -140        -135
1    29            西漢            元光         -134        -129
2    29            西漢            元朔         -128        -123
3    29            西漢            元狩         -122        -117
4    29            西漢            元鼎         -116        -111

In [19]:
era_df.to_excel('Named.xlsx', sheet_name='era2')

In [ ]:
!dir

In [24]:
sql_statement = '''
select c_personid, c_name_chn, c_index_year, c_surname_chn, c_mingzi_chn from biog_main
WHERE c_index_year between 265 and 479
'''.strip()

In [ ]:
CDBD_persons_df = pd.read_sql_query(sql_statement, cnx)
CDBD_persons_df.head()

In [26]:
CDBD_persons_df.to_excel('CDBD_persons.xlsx')

In [ ]:
cnx.close()